blog-cn/the-common-lisp-development-environment.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>如何搭建 SLIME 环境</title>
<!-- 2018-01-24 Wed 09:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Siqing Mu" />
<link rel="shortcut icon" href="https://www.khow.me/blog-cn/images/favicon.ico" />
<link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content">
<h1 class="title">如何搭建 SLIME 环境</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. sbcl</a></li>
<li><a href="#sec-2">2. Emacs</a></li>
<li><a href="#sec-3">3. Quicklisp</a></li>
<li><a href="#sec-4">4. Slime</a></li>
<li><a href="#sec-5">5. .emacs</a></li>
<li><a href="#sec-6">6. start</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> sbcl</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
brew install sbcl
</pre>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Emacs</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
brew install emacs
</pre>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Quicklisp</h2>
<div class="outline-text-2" id="text-3">
<p>
Quicklisp is a library manager for Common Lisp. It works with your existing Common Lisp implementation to download,
install, and load any of over 1,500 libraries with a few simple commands.Quicklisp is easy to install and works with 
ABCL, Allegro CL, Clasp, Clozure CL, CLISP, CMUCL, ECL, LispWorks, MKCL, SBCL, and Scieneer CL, on Linux, Mac OS X, and Windows. 
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Slime</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
curl -O https://beta.quicklisp.org/quicklisp.lisp

sbcl --load quicklisp.lisp

(quicklisp-quickstart:install)

(ql:quickload "quicklisp-slime-helper")

(ql:add-to-init-file)
</pre>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> .emacs</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
(load (expand-file-name "~/quicklisp/slime-helper.el"))
;; Replace "sbcl" with the path to your implementation
(setq inferior-lisp-program "sbcl")
</pre>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> start</h2>
<div class="outline-text-2" id="text-6">
<pre class="example">
M-x slime
</pre>
</div>
</div>
</div>
</body>
</html>
